eisup_2019_docmng_integration/src/DataProcessors/kmw_МониторЗагрузкиАгентскихОтчётов/kmw_МониторЗагрузкиАгентскихОтчётов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>kmw_МониторЗагрузкиАгентскихОтчётов</name>
  <attributes>
    <name>ЗаПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтражения</name>
    <type>
      <types>CatalogRef.ас_ПериодыОтражения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьФаловЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АгентскиеДоговоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОКОП</name>
      <type>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИсторияСтатусовКадровоРасчетныхДокументов/абс_ИсторияСтатусовКадровоРасчетныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИсторияСтатусовКадровоРасчетныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыКадровоРасчетныхДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</types>
      <types>DocumentRef.ПремииРаботниковОрганизаций</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыКадровоРасчетныхДокументов/абс_СтатусыКадровоРасчетныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыКадровоРасчетныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Подписание</name>
  </enumValues>
  <enumValues>
    <name>Согласование</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПринятыхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>Рассчитан</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>DocumentRef.абс_ЗадачаТЭО</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>DocumentRef.абс_ПоступлениеУниверсальныйСклад</types>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>CatalogRef.абс_ТЭО</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_ПеремещениеУниверсальныйСклад</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.абс_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.абс_ИзменениеКонтрагентаВДоговоре</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.абс_ПлановыеРегламентныеРаботы</types>
      <types>DocumentRef.ПеремещениеМатериаловВЭксплуатации</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВЭксплуатацию</types>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>DocumentRef.абс_ЗаявкаНаДобавлениеИзменениеПрав</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
      <types>DocumentRef.абс_ВводЗначенийПоказателейДляРасчетаКПЭ</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.абс_ПереносДанных</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>DocumentRef.абс_АВИЗО</types>
      <types>CatalogRef.абс_ИнструкцииПользователя</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>BusinessProcessRef.абсЗаявкаВПоддержку</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.абс_ВыбытиеУниверсальныйСклад</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.абс_ЗаявкаНаПроект</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИтоговыйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоСчетСканСчетаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗагруженИзИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СвойствоОС</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипДокумента</name>
    <type>
      <types>CatalogRef.абс_ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ХэшФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СсылкаНаАналогичныйФайл</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/DataProcessors/kmw_МониторЗагрузкиАгентскихОтчётов/Forms/Форма1/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписок();
КонецПроцедуры

// ОбновлениеСтатусовДокументов
//
Процедура ОбновлениеСтатусовДокументов()
	Для каждого ТекСтрока Из Объект.АгентскиеДоговоры Цикл
		ТекСтрока.Статус = РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.ВернутьСтатусДокумента(ТекСтрока.ДокументОКОП);
	КонецЦикла;
КонецПроцедуры // ()


&НаКлиенте
Процедура ВывестиДоговоры(Команда)
	Если ПроверитьЗаполнение() Тогда
		
		ВывестиДоговорыСервер();
	
	КонецЕсли;   
		
КонецПроцедуры

Процедура ВывестиДоговорыСервер()
	Объект.АгентскиеДоговоры.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		//ПЕРВЫЕ 2
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ОтчетКомиссионераОПродажах_вз.ДокументОКОП КАК ДокументОКОП,
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	абс_ИсторияСтатусовКадровоРасчетныхДокументовСрезПоследних.Статус КАК Статус,
		|	абс_ИсторияСтатусовКадровоРасчетныхДокументовСрезПоследних.Пользователь КАК Пользователь,
		|	абс_ИсторияСтатусовКадровоРасчетныхДокументовСрезПоследних.Комментарий КАК Комментарий
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОтчетКомиссионераОПродажах.Ссылка КАК ДокументОКОП,
		|			ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента
		|		ИЗ
		|			Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|		ГДЕ
		|			ОтчетКомиссионераОПродажах.Дата >= &НачалоПериода
		|			И ОтчетКомиссионераОПродажах.Дата <= &КонецПериода) КАК ОтчетКомиссионераОПродажах_вз
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.СрезПоследних КАК абс_ИсторияСтатусовКадровоРасчетныхДокументовСрезПоследних
		|			ПО ОтчетКомиссионераОПродажах_вз.ДокументОКОП = абс_ИсторияСтатусовКадровоРасчетныхДокументовСрезПоследних.Документ
		|		ПО ДоговорыКонтрагентов.Ссылка = ОтчетКомиссионераОПродажах_вз.ДоговорКонтрагента
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговоровКонтрагентов
		|	И ДоговорыКонтрагентов.Организация = &Организация";

	//Запрос.УстановитьПараметр("ВидДоговоровКонтрагентов", Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	Запрос.УстановитьПараметр("ВидДоговоровКонтрагентов", ВидДоговора);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ЗаПериод));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ЗаПериод));

	Результат = Запрос.Выполнить();
	//Результат.Выгрузить();
	Объект.АгентскиеДоговоры.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДокументыПоТЧ(Команда)
	ПодготовитьДокументыПоТЧ_Сервер();
КонецПроцедуры
Процедура ПодготовитьДокументыПоТЧ_Сервер(ИмяТЧ=Неопределено)
	Если ИмяТЧ=Неопределено Тогда
		ИмяТЧ = "АгентскиеДоговоры";
		Договоры_тз = Объект[ИмяТЧ];
	КонецЕсли;  
	Для каждого ТекСтрТЧ Из Договоры_тз Цикл
		Если ЗначениеЗаполнено(ТекСтрТЧ.ДокументОКОП)=Ложь Тогда
			НовДок = Документы.ОтчетКомиссионераОПродажах.СоздатьДокумент();
			ПараметрыЗаполнения = Новый Структура("Дата,ДоговорКонтрагента,Контрагент,Организация",НачалоДня(КонецМесяца(Объект.ЗаПериод)), ТекСтрТЧ.Договор, ТекСтрТЧ.Договор.Владелец, Объект.Организация);
			НовДок.Заполнить(ПараметрыЗаполнения); 
		    НовДок.Записать(РежимЗаписиДокумента.Запись);
			ТекСтрТЧ.ДокументОКОП = НовДок.Ссылка;
			ТекСтрТЧ.Комментарий = "Подготовка из монитора";
			РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.УстановитьСтатус(ТекСтрТЧ.ДокументОКОП, Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка,,ТекСтрТЧ.Комментарий);
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыДокументов(Команда)
	ОбновлениеСтатусовДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры

Процедура ОбновитьСписок()
	Список.Параметры.УстановитьЗначениеПараметра("ВидДоговоровКонтрагентов", ВидДоговора);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоМесяца(Объект.ЗаПериод));
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецМесяца(Объект.ЗаПериод));
КонецПроцедуры


&НаКлиенте
Процедура Страницы_ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница=Элементы.ДинамическийСписок Тогда
		ОбновитьСписок();
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПодготовитьДокументыПоВыделенному(Команда)
	ВыделеныСтроки_мс = Элементы.Список.ВыделенныеСтроки;
	БылиВыделены_фмс = Новый ФиксированныйМассив(ВыделеныСтроки_мс); //ФиксированныйМассив вместо массива, чтобы он не обновлялся при смене ткущей строки
	ПодготовитьДокументыПоВыделенному_(БылиВыделены_фмс);
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДокументыПоВыделенному_(Знач ВыделеныСтроки_мс)
	ДоговорыДляДокументов_мс = Новый Массив;
	
	Для каждого ТекВыдСтрока Из ВыделеныСтроки_мс Цикл
		Элементы.Список.ТекущаяСтрока = ТекВыдСтрока;
		ДанныеСтроки = Элементы.Список.ТекущиеДанные;
		Если ДанныеСтроки.Свойство("ДокументОКОП") И ЗначениеЗаполнено(ДанныеСтроки.ДокументОКОП)=Ложь Тогда
			ДоговорыДляДокументов_мс.Добавить(ДанныеСтроки.Договор);
		КонецЕсли; 
	КонецЦикла;
	СоздадимДокументыДоговоров(ДоговорыДляДокументов_мс);
	
КонецПроцедуры

Процедура СоздадимДокументыДоговоров(ДоговорыДляДокументов_мс)
	Для каждого ТекДоговор Из ДоговорыДляДокументов_мс Цикл
			НовДок = Документы.ОтчетКомиссионераОПродажах.СоздатьДокумент();
			ПараметрыЗаполнения = Новый Структура("Дата,ДоговорКонтрагента,Контрагент,Организация",НачалоДня(КонецМесяца(Объект.ЗаПериод)), ТекДоговор, ТекДоговор.Владелец, Объект.Организация);
			НовДок.Заполнить(ПараметрыЗаполнения); 
			НовДок.kmw_Статус = Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка; 
			НовДок.kmw_КомментарийЗагрузки ="Создан из монитора"; 
		    НовДок.Записать(РежимЗаписиДокумента.Запись);
			ДокументОКОП = НовДок.Ссылка;
			Комментарий = "Создан из монитора";
			РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.УстановитьСтатус(ДокументОКОП, Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка,,Комментарий);
	КонецЦикла; 
	ОбновитьСписок();
	ВывестиДоговорыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыПоТЧ(Команда)
	ПрикрепитьФайлыПоТЧ_Сервер();
КонецПроцедуры
Процедура ПрикрепитьФайлыПоТЧ_Сервер()
	ПроверитьПодготовитьКаталог();
	Для каждого ТекСтрТЧ Из Объект.АгентскиеДоговоры Цикл
		Если ЗначениеЗаполнено(ТекСтрТЧ.ДокументОКОП) И ЗначениеЗаполнено(ТекСтрТЧ.ДокументОКОП.kmw_ФайлЗагрузки)=Ложь Тогда
			ИмяФайла = "Отчет Агента "+СокрЛП(ТекСтрТЧ.Договор.Владелец.ИНН)+" дог "+СокрЛП(ТекСтрТЧ.Договор.Код)+" за "+Формат(КонецМесяца(Объект.ЗаПериод),"ДФ=yyyy-MM-dd")+".xlsx";
			ИмяФайла = РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(ИмяФайла);
			ПолноеИмя = Объект.ПутьФаловЗагрузки+ИмяФайла;
			Если ПроверитьСуществованиеКаталога(ПолноеИмя)=Ложь Тогда
				ТекСтрТЧ.Комментарий = "Не найден файл "+ПолноеИмя;
			Иначе	
				ДД = Новый ДвоичныеДанные(Объект.ПутьФаловЗагрузки+ИмяФайла);
				СтруктураВозврата = абс_РаботаСФайлами.ЗаписатьФайлВоВнешнееХранилище(ТекСтрТЧ.ДокументОКОП, ДД,ИмяФайла);
				Если СтруктураВозврата.Успешно Тогда
					ФайлЗагрузки = СтруктураВозврата.ХранилищеСсылка;
					ТекДок = ТекСтрТЧ.ДокументОКОП.ПолучитьОбъект();  
					ТекДок.kmw_ФайлЗагрузки = ФайлЗагрузки;
					ТекДок.kmw_Статус = Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка;
					ТекДок.kmw_КомментарийЗагрузки = "Прикреплён полученный файл";
				    ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекСтрТЧ.Комментарий = "Прикреплён полученный файл";
					ПереместитьФайл(ПолноеИмя,ИмяКаталогаОбработанных+"\"+ИмяФайла+".xlsx");
				Иначе
					ТекСтрТЧ.Комментарий = "Не найден файл "+ИмяФайла+" в функции ЗаписатьФайлВоВнешнееХранилище";
				КонецЕсли; 
			КонецЕсли; 
			РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.УстановитьСтатус(ТекСтрТЧ.ДокументОКОП, Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка,,ТекСтрТЧ.Комментарий);
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры
 
//&НаКлиентеНаСервере
Функция ПроверитьСуществованиеКаталога(ИмяКаталога) Экспорт
    КаталогНаДиске = Новый Файл(ИмяКаталога);
    Если КаталогНаДиске.Существует() Тогда
        Возврат Истина;
    Иначе
        Возврат Ложь;
    КонецЕсли;
КонецФункции 

//&НаКлиенте
Процедура ПроверитьПодготовитьКаталог()
	Объект.ПутьФаловЗагрузки=Сокрлп(Объект.ПутьФаловЗагрузки);
	Если ЗначениеЗаполнено(Объект.ПутьФаловЗагрузки)=Ложь ИЛИ ПроверитьСуществованиеКаталога(Сокрлп(Объект.ПутьФаловЗагрузки))=Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружен каталог со стороны сервера "+Объект.ПутьФаловЗагрузки, ,"Объект.ПутьФаловЗагрузки");
		Возврат;
	КонецЕсли;
	
	Объект.ПутьФаловЗагрузки=Объект.ПутьФаловЗагрузки+?(Прав(Объект.ПутьФаловЗагрузки,1)="\","","\");
	ИмяКаталогаОбработанных = Объект.ПутьФаловЗагрузки+СокрЛП(Объект.Организация.Префикс)+" за "+Формат(КонецМесяца(Объект.ЗаПериод),"ДФ=yyyy-MM-dd")+" ОБРАБОТАНО";
	Если ПроверитьСуществованиеКаталога(ИмяКаталогаОбработанных)=Ложь Тогда
		СоздатьКаталог(ИмяКаталогаОбработанных);
	КонецЕсли;
КонецПроцедуры
 

&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)
	ПрикрепитьФайлы_Сервер();

    ПрикрепитьФайлыПоТЗ_Сервер();
	Элементы.Список.Обновить();
КонецПроцедуры

Процедура ПрикрепитьФайлы_Сервер()
	
	ПроверитьПодготовитьКаталог();
	
	НовыеФайлы_мс = НайтиФайлы(Объект.ПутьФаловЗагрузки,"*.xlsx",Ложь);
	НайденыФайлы.Очистить();
    //подготовим тз для поиска документов к файлам
	Для каждого ТекФайл Из НовыеФайлы_мс Цикл
		Если ЗначениеЗаполнено(ТекФайл.Имя) Тогда
			НоваяСтрокаПоИмениФайла(Строка(ТекФайл.Имя));
		КонецЕсли; 
		//ДокументФайла = НайтиДокументПоИмениФайла(Строка(ТекФайл.Имя));	
	КонецЦикла; 
	//

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПоиска_вт.АгентИНН,
		|	ДанныеПоиска_вт.АгентКодДоговора,
		|	ДанныеПоиска_вт.ИмяФайла,
		|	ДанныеПоиска_вт.ДатаДок
		|ПОМЕСТИТЬ ДанныеПоиска__ВТ
		|ИЗ
		|	&ДанныеПоиска_вт КАК ДанныеПоиска_вт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДанныеПоиска__ВТ.ДатаДок,
		|	ДанныеПоиска__ВТ.АгентИНН,
		|	ДанныеПоиска__ВТ.АгентКодДоговора,
		|	ДанныеПоиска__ВТ.ИмяФайла,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ПОМЕСТИТЬ ДоговорыАгентов__ВТ
		|ИЗ
		|	ДанныеПоиска__ВТ КАК ДанныеПоиска__ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ДанныеПоиска__ВТ.АгентИНН = ДоговорыКонтрагентов.Владелец.ИНН
		|			И ДанныеПоиска__ВТ.АгентКодДоговора = ДоговорыКонтрагентов.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажах.Ссылка КАК ДокументОКОП,
		|	ДоговорыАгентов__ВТ.Договор,
		|	ДоговорыАгентов__ВТ.ДатаДок,
		|	ДоговорыАгентов__ВТ.АгентИНН,
		|	ДоговорыАгентов__ВТ.АгентКодДоговора,
		|	ДоговорыАгентов__ВТ.ИмяФайла,
		|	ДоговорыАгентов__ВТ.Контрагент
		|ИЗ
		|	ДоговорыАгентов__ВТ КАК ДоговорыАгентов__ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОтчетКомиссионераОПродажах.Ссылка КАК Ссылка,
		|			ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|			ОтчетКомиссионераОПродажах.Дата КАК Дата
		|		ИЗ
		|			Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|		ГДЕ
		|			(ОтчетКомиссионераОПродажах.kmw_Статус = &Подготовка
		|					ИЛИ ОтчетКомиссионераОПродажах.kmw_Статус = &Отказ)) КАК ОтчетКомиссионераОПродажах
		|		ПО ДоговорыАгентов__ВТ.Договор = ОтчетКомиссионераОПродажах.ДоговорКонтрагента";

		
	Запрос.УстановитьПараметр("ДанныеПоиска_вт", НайденыФайлы.Выгрузить(,"АгентИНН,АгентКодДоговора,ИмяФайла,ДатаДок"));
	Запрос.УстановитьПараметр("КонДняМесяца", КонецДня(Объект.ЗаПериод));
	Запрос.УстановитьПараметр("НачДняМесяца", НачалоДня(Объект.ЗаПериод));
	Запрос.УстановитьПараметр("Отказ", Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Отказ);
	Запрос.УстановитьПараметр("Подготовка", Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка);

	Результат = Запрос.Выполнить();
    Результат_тз = Результат.Выгрузить();
	//Результат_тз.ВыбратьСтроку("Это надо видеть!");
	НайденыФайлы.Загрузить(Результат_тз);
	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
КонецПроцедуры

Процедура НоваяСтрокаПоИмениФайла(Знач ИмяФайла)
	НовСтрока = НайденыФайлы.Добавить();
	НовСтрока.ИмяФайла = ИмяФайла;
	//Вычислим дату документа
	ПозДаты = Найти(ИмяФайла," за ")+4;
	ДатаДок = Сред(ИмяФайла,ПозДаты,10);
	Попытка
		ДатаДок = Дата(Число(Лев(ДатаДок,4)),Число(сред(ДатаДок,6,2)), Число(сред(ДатаДок,9,2)));	
	Исключение
		Сообщить("не верный формат имени файла:"+НовСтрока.ИмяФайла+"
		| Документ не создан.",СтатусСообщения.Важное);
	КонецПопытки; 
	НовСтрока.ДатаДок = НачалоДня(КонецМесяца(ДатаДок));

	//Вычислим ИНН контрагента документа
	ОстатокИмениФайлаБезДаты = Лев(ИмяФайла,ПозДаты);
	ПозДоговора = Найти(ИмяФайла," дог ");
	ОстатокИмениФайлаБезДоговора = Лев(ИмяФайла,ПозДоговора);
	АгентИНН = Сред(ОстатокИмениФайлаБезДоговора,14); АгентИНН=СокрЛП(АгентИНН);
	АгентКодДоговора = Сред(ОстатокИмениФайлаБезДаты,ПозДоговора+5); АгентКодДоговора=СокрЛП(АгентКодДоговора);
	
	НовСтрока.АгентИНН = АгентИНН;
	НовСтрока.АгентКодДоговора = АгентКодДоговора;

КонецПроцедуры // ()
 
Процедура ПрикрепитьФайлыПоТЗ_Сервер()
	Объект.ПутьФаловЗагрузки=Сокрлп(Объект.ПутьФаловЗагрузки);
	Если ЗначениеЗаполнено(Объект.ПутьФаловЗагрузки)=Ложь ИЛИ ПроверитьСуществованиеКаталога(Сокрлп(Объект.ПутьФаловЗагрузки))=Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружен каталог со стороны сервера "+Объект.ПутьФаловЗагрузки, ,"Объект.ПутьФаловЗагрузки");
		Возврат;
	КонецЕсли;
	
	Объект.ПутьФаловЗагрузки=Объект.ПутьФаловЗагрузки+?(Прав(Объект.ПутьФаловЗагрузки,1)="\","","\");
	ИмяКаталогаОбработанных = Объект.ПутьФаловЗагрузки+СокрЛП(Объект.Организация.Префикс)+" за "+Формат(КонецМесяца(Объект.ЗаПериод),"ДФ=yyyy-MM-dd")+" ОБРАБОТАНО";
	Если ПроверитьСуществованиеКаталога(ИмяКаталогаОбработанных)=Ложь Тогда
		СоздатьКаталог(ИмяКаталогаОбработанных);
	КонецЕсли;  
	
	
	Для каждого ТекСтрТЧ Из НайденыФайлы Цикл
		Если ЗначениеЗаполнено(ТекСтрТЧ.ДокументОКОП)=Ложь И ЗначениеЗаполнено(ТекСтрТЧ.ИмяФайла) Тогда
			Сообщить("Получен файл:"+ТекСтрТЧ.ИмяФайла+" с неверным наименованием. ");
		//ИначеЕсли ЗначениеЗаполнено(ТекСтрТЧ.ДокументОКОП)	И ЗначениеЗаполнено(ТекСтрТЧ.ДокументОКОП.kmw_ФайлЗагрузки)=Ложь Тогда
		ИначеЕсли ЗначениеЗаполнено(ТекСтрТЧ.ДокументОКОП) Тогда
			ИмяФайла = ТекСтрТЧ.ИмяФайла;
			ПолноеИмя = Объект.ПутьФаловЗагрузки+ИмяФайла;
			Если ПроверитьСуществованиеКаталога(ПолноеИмя)=Ложь Тогда
				ТекСтрТЧ.Комментарий = "Не найден файл "+ПолноеИмя;
			Иначе	
				ДД = Новый ДвоичныеДанные(Объект.ПутьФаловЗагрузки+ИмяФайла);
				СтруктураВозврата = абс_РаботаСФайлами.ЗаписатьФайлВоВнешнееХранилище(ТекСтрТЧ.ДокументОКОП, ДД,ИмяФайла);
				Если СтруктураВозврата.Успешно Тогда
					ФайлЗагрузки = СтруктураВозврата.ХранилищеСсылка;
					ТекДок = ТекСтрТЧ.ДокументОКОП.ПолучитьОбъект();  
					ТекДок.kmw_ФайлЗагрузки = ФайлЗагрузки;
					ТекДок.kmw_Статус = Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка;
					ТекДок.kmw_КомментарийЗагрузки = "Прикреплён полученный файл";
				    ТекДок.Записать(РежимЗаписиДокумента.Запись);
					ТекСтрТЧ.Комментарий = "Прикреплён полученный файл";
					ПереместитьФайл(ПолноеИмя,ИмяКаталогаОбработанных+"\"+ИмяФайла+".xlsx");
				Иначе
					ТекСтрТЧ.Комментарий = "Не найден файл "+ИмяФайла+" в функции ЗаписатьФайлВоВнешнееХранилище";
				КонецЕсли; 
			КонецЕсли; 
			РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.УстановитьСтатус(ТекСтрТЧ.ДокументОКОП, Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка,,ТекСтрТЧ.Комментарий);
		КонецЕсли; 
	КонецЦикла; 
	
	//Оставшимся без файлов допишем

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ОтчетКомиссионераОПродажах_вз.ДокументОКОП КАК ДокументОКОП,
		|	ДоговорыКонтрагентов.ВидДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОтчетКомиссионераОПродажах.Ссылка КАК ДокументОКОП,
		|			ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента
		|		ИЗ
		|			Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|		ГДЕ
		|			ОтчетКомиссионераОПродажах.Дата >= &НачалоПериода
		|			И ОтчетКомиссионераОПродажах.Дата <= &КонецПериода
		|			И ОтчетКомиссионераОПродажах.kmw_ФайлЗагрузки = &ПустойФайлЗагрузки) КАК ОтчетКомиссионераОПродажах_вз
		|		ПО ДоговорыКонтрагентов.Ссылка = ОтчетКомиссионераОПродажах_вз.ДоговорКонтрагента
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговоровКонтрагентов
		|	И ДоговорыКонтрагентов.Организация = &Организация";

	Запрос.УстановитьПараметр("ВидДоговоровКонтрагентов", ВидДоговора);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ЗаПериод));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ЗаПериод));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПустойФайлЗагрузки", Справочники.ХранилищеДополнительнойИнформации.ПустаяСсылка());

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяФайла = "Отчет Агента "+СокрЛП(ВыборкаДетальныеЗаписи.Договор.Владелец.ИНН)+" дог "+СокрЛП(ВыборкаДетальныеЗаписи.Договор.Код)+" за "+Формат(КонецМесяца(Объект.ЗаПериод),"ДФ=yyyy-MM-dd")+".xlsx";
		ИмяФайла = РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(ИмяФайла);
		ТекДок = ВыборкаДетальныеЗаписи.ДокументОКОП.ПолучитьОбъект();  
		ТекДок.kmw_КомментарийЗагрузки = "Не найден файл "+ИмяФайла;
	    ТекДок.Записать(РежимЗаписиДокумента.Запись);
		
		РегистрыСведений.абс_ИсторияСтатусовКадровоРасчетныхДокументов.УстановитьСтатус(ВыборкаДетальныеЗаписи.ДокументОКОП, Перечисления.абс_СтатусыКадровоРасчетныхДокументов.Подготовка,,"Не найден файл "+ИмяФайла);
	КонецЦикла;

КонецПроцедуры
 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ИмяПоля = СтрЗаменить(Поле.Имя,"Список","");
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ОткрытьЗначение(ТД[ИмяПоля]);
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналДокументов(Команда)
	ЖД_уф = ОткрытьФорму("Документ.ОтчетКомиссионераОПродажах.Форма.ФормаСпискаУправляемая");
	ПериодЖурнала=Новый СтандартныйПериод;
	ПериодЖурнала.Вариант=ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодЖурнала.ДатаНачала=НачалоМесяца(Объект.ЗаПериод);
	ПериодЖурнала.ДатаОкончания=КонецМесяца(Объект.ЗаПериод);
	
	ЖД_уф.Элементы.Список.Период = ПериодЖурнала;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФайлы(Команда)
	
	ПрикрепитьФайлы_Сервер();	
	ПодготовитьДокументыПоТЧ_Сервер()
КонецПроцедуры
